src/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮридическоеФизическоеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ЮридическоеФизическоеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЮридическоеФизическоеЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/Контрагенты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Тип = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо") Тогда
		Элементы.КПП.Видимость = Истина;
	ИначеЕсли Объект.Тип = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо") Тогда
		Элементы.КПП.Видимость = Ложь;
	Иначе
		ТекстСообщения = "Не выбран тип контрагента";
		Сообщить(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	
	Если Объект.Тип = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо") Тогда
		Элементы.КПП.Видимость = Истина;
	ИначеЕсли Объект.Тип = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо") Тогда
		Элементы.КПП.Видимость = Ложь;
	Иначе
		ТекстСообщения = "Не выбран тип контрагента";
		Сообщить(ТекстСообщения);
	КонецЕсли; 
	
	КонецПроцедуры    

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если АвтоматическоеЗаполнение Или Не ЗначениеЗаполнено(Объект.ПолноеНаименование) Тогда
	Объект.ПолноеНаименование = РазвернутыеОПФ(Объект.Наименование);
	КонецЕсли;
КонецПроцедуры  

&НаСервере
Функция РазвернутыеОПФ(Наименование) 
	
	Если Не ЗначениеЗаполнено(Наименование) Тогда
        Возврат "";
	КонецЕсли; 
	
	Наименование = СокрЛП(Наименование);
	НаименованиеМассив = СтрРазделить(Наименование, " ,.!;:?*)(«»" + Символы.ПС, Ложь);
	
	ОПФ = Новый Соответствие;
	ОПФ.Вставить("АО", "Акционерное общество");
	ОПФ.Вставить("ПАО", "Публичное акционерное общество");
	ОПФ.Вставить("ЗАО", "Закрытое акционерное общество");
	ОПФ.Вставить("ООО", "Общество с ограниченной ответственностью");
	ОПФ.Вставить("ИП", "Индивидуальный предприниматель");
	ОПФ.Вставить("НКО", "Некоммерческая организация");
	ОПФ.Вставить("ГУП", "Государственное унитарное предприятие");
	ОПФ.Вставить("МУП", "Муниципальное унитарное предприятие"); 
	
	ПолноеНаименованиеМассив = Новый Массив;
	
	Для Каждого Слово Из НаименованиеМассив Цикл
		РазвернутыйОПФ = ОПФ.Получить(Слово);
		Если РазвернутыйОПФ <> Неопределено Тогда
			ПолноеНаименованиеМассив.Добавить(РазвернутыйОПФ);
		Иначе
			ПолноеНаименованиеМассив.Добавить(Слово);
		КонецЕсли;
	КонецЦикла;
	
	ПолноеНаименование = СтрСоединить(ПолноеНаименованиеМассив, " ");
	Возврат ПолноеНаименование;

КонецФункции 


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Объект.Тип) Тогда
		ТекстСообщения = "Не выбран тип контрагента";
		Сообщить(ТекстСообщения);
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ВалидацияИНН.ПроверитьИНН(Объект.ИНН, Объект.Тип) Тогда
		Отказ = Истина;
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	
	Если Не ВалидацияИНН.ПроверитьИНН(Объект.ИНН, Объект.Тип) Тогда
		Элементы.ИНН.ЦветТекста = WebЦвета.Красный;
	Иначе 
		Элементы.ИНН.ЦветТекста = WebЦвета.Черный;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если Объект.ПолноеНаименование = РазвернутыеОПФ(Объект.Наименование) Тогда
		АвтоматическоеЗаполнение = Истина;
	Иначе
		АвтоматическоеЗаполнение = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолноеНаименованиеПриИзменении(Элемент)
	АвтоматическоеЗаполнение = Ложь;
КонецПроцедуры
